Repository: RafaelOstertag/yapet
Catalog: po/*.po
Languages: de

source: May you consider deleting the window before reallocating
de: Zuerst Fenster löschen bevor wiederallozieren

source: May you consider deleting the button before reallocating
de: Zuerst Knopf löschen bevor wiederallozieren

source: Error creating message window
de: Kann Listenfenster nicht erstellen

source: Error deleting message box
de: Fehler beim Fensterlöschen

source: Error erasing window
de: Fehler beim Löschen des Fensters

source: Error creating box around message window
de: Fehler beim Zeichnen des Fensterrahmens

source: Error printing message
de: Fehler beim Titel anzeigen

source: Error printing title
de: Fehler beim Titel anzeigen

source: Error refreshing message box
de: Fehler beim Auffrischen der Statusleiste

source: Error creating button
de: Fehler beim Zeichnen des Rahmens

source: Error clearing button
de: Kann die Liste nicht löschen

source: Error refreshing button
de: Kann die Liste nicht auffrischen

source: Error deleting button
de: Fehler beim Fensterlöschen

source: Error erasing button
de: Fehler beim Zeichnen des Rahmens

source: Error touching window
de: Kann Fenster nicht antasten

source: Error setting keypad
de: Kann Zahlenblock nicht einschalten

source: Error printing check box
de: Fehler beim zeigen der Check Box

source: Error moving cursor for widget
de: Fehler beim verschieben des Cursors

source: Error printing check box item
de: Fehler beim Anzeigen des Check Box Items

source: Error creating checkbox window
de: Fehler beim Erstellen des Check Box Fensters

source: Error enabling keypad
de: Kann Zahlenblock nicht einschalten

source: No idea of the dimension of the widget
de: Keine Ahnung der Dimension des Widgets

source: Error setting border
de: Fehler beim setzen des Rahmens

source: Cancel
de: Abbrechen

source: May you consider deleting the window first before reallocating it
de: Zuerst Fenster löschen bevor wiederallozieren

source: Error creating the input window
de: Kann Listenfenster nicht erstellen

source: Error clearing input widget
de: Fehler beim Löschen der Zeile

source: Error setting keypad on input widget
de: Kann die Schlüssellänge nicht setzen

source: Error refreshing the widget
de: Kann das Listen-Widget nicht auffrischen

source: Error moving cursor
de: Fehler beim verschieben des Cursors

source: Error refreshing input widget
de: Kann das Listen-Widget nicht auffrischen

source: Error deleting input widget
de: Fehler beim Fensterlöschen

source: Error adding text to window
de: Fehler beim Zeichnen des Fensterrahmens

source: Need at least a resolution of %dx%d.
de: Benötige mindestens eine Auflösung von %dx%d

source: Default constructor must not be used!
de: Standardkonstruktor darf nicht gebraucht werden!

source: Error clearing window
de: Fehler beim Löschen des Fensters

source: Error drawing box around window
de: Fehler beim Zeichnen des Fensterrahmens

source: Unable to display scroll up indicator
de: Kann Scroll-Up Indikator nicht anzeigen

source: Unable to display scroll down indicator
de: Kann Scroll-Down Indikator nicht anzeigen

source: Unable to display item
de: Kann Eintrag nicht anzeigen

source: Error displaying cursor
de: Kann Cursor nicht anzeigen

source: Error move cursor
de: Kann Cursor nicht bewegen

source: Error refreshing window
de: Kann Fenster nicht auffrischen

source: Error creating list window
de: Kann Listenfenster nicht erstellen

source: Error re-setting the border
de: Kann den Rahmen nicht neu setzen

source: No idea of the dimension of the list
de: Keine Ahnung der Dimension der Liste

source: Error setting the border of window
de: Kann den Fensterrahmen nicht setzen

source: Error refreshing the list widget
de: Kann das Listen-Widget nicht auffrischen

source: Error refreshing list
de: Kann die Liste nicht auffrischen

source: Error clearing list
de: Kann die Liste nicht löschen

source: Error deleting window
de: Fehler beim Fensterlöschen

source: Generic UI exception
de: Generische UI Ausnahme

source: IVec length missmatch
de: IVec Länge falsch

source: Error initializing encryption engine
de: Fehler beim Initialisieren der Verschlüsselung

source: Error setting the key length
de: Kann die Schlüssellänge nicht setzen

source: Error encrypting data
de: Fehler beim Verschlüsseln der Daten

source: Error finalizing encryption
de: Fehler beim Abschliessen der Verschlüsselung

source: Error decrypting data
de: Fehler beim Entschlüsseln der Daten

source: Error finalizing decryption
de: Fehler beim Abschliessen der Entschlüsselung

source: Memory exhausted
de: Speicher aufgebraucht

source: BDBuffer too small. Cannot assign to Record<T>
de: BDBuffer zu klein. Kann nicht an Record<T> zuweisen

source: BDBuffer too big. Cannot assign to Record<T>
de: BDBuffer zu gross. Kann nicht an Record<T> zuweisen.

source: Generic exception message
de: Generische Ausnahmenachricht

source: Retry
de: Wiederholen

source: Encryption error
de: Verschlüsselungsfehler

source: Invalid password
de: Falsches Passwort

source: Position out of range
de: Position ausserhalb des Bereiches

source: Unable to get cipher
de: Kann die Verschlüsselung nicht ermitteln

source: Error initializing cipher
de: Fehler beim Initialisieren der Verschlüsselung

source: You are not the owner of
de: Sie sind nicht der Eigner von

source: Permissions of
de: Zugriffsrechte von

source: not secure.
de: nicht sicher.

source: Cannot set the owner of
de: Kann Eigentümer nicht setzen:

source: Cannot set file permissions on
de: Zugriffsrechte setzen nicht möglich:

source: Error seeking within file:
de: Fehler beim Positionieren innerhalb von:

source: Unable to seek to data section
de: Kann den Datenabschnitt nicht finden

source: Short read on file:
de: Abruptes Ende beim Lesen von:

source: File has been modified
de: Datei wurde verändert

source: Short write on file:
de: Abruptes Ende beim Schreiben von:

source: EOF encountered while reading header
de: Ende der Datei während lesen des Dateikopfes erreicht

source: Sanity check for control field failed
de: Plausibiltätskontrolle für Kontrollfeld fehlgeschlagen

source: Unknown exception catched
de: Unbekannte Ausnahme aufgetreten

source: File type not recognized
de: Filetyp unbekannt

source: Null pointer passed in ptr32
de: Null Zeiger in ptr32 übergeben.

source: Null pointer passed in ptr64
de: Null Zeiger in ptr64 übergeben.

source: Run 1: Unable to initialize the EVP_MD structure
de: Lauf 1: Kann EVP_MD Struktur nicht initialisieren

source: Run 1: Unable to initialize the digest
de: Lauf 1: Kann Digest nicht initialisieren

source: Run 1: Unable to update the digest
de: Lauf 1: Digest kann nicht angepasst werden

source: Run 1: Unable to finalize the digest
de: Lauf 1: Kann Digest nicht abschliessen

source: Run 1: Digest does not have expected length
de: Lauf 1: Digest hat unerwartete Länge

source: Run 2: Unable to initialize the EVP_MD structure
de: Lauf 2: Kann EVP_MD Struktur nicht initialisieren

source: Run 2: Unable to initialize the digest
de: Lauf 2: Kann Digest nicht initialisieren

source: Run 2: Unable to update the digest
de: Lauf 2: Digest kann nicht angepasst werden

source: Run 2: Unable to finalize the digest
de: Lauf 2: Kann Digest nicht abschliessen

source: Run 2: Digest does not have expected length
de: Lauf 2: Digest hat unerwartete Länge

source: Run 3: Unable to initialize the EVP_MD structure
de: Lauf 3: Kann EVP_MD Struktur nicht initialisieren

source: Run 3: Unable to initialize the digest
de: Lauf 3: Kann Digest nicht initialisieren

source: Run 3: Unable to update the digest
de: Lauf 3: Digest kann nicht angepasst werden

source: Run 3: Unable to finalize the digest
de: Lauf 3: Kann Digest nicht abschliessen

source: Run 3: Digest does not have expected length
de: Lauf 3: Digest hat unerwartete Länge

source: Effective key length of %d does not match expected key length %d
de: Die effektive Schlüssellänge %d passt nicht auf die erwartete Schlüssellänge %d

source: IVec: Unable to initialize the EVP_MD structure
de: IVec: Kann EVP_MD Struktur nicht initialisieren

source: IVec: Unable to initialize the digest
de: IVec: Kann Digest nicht initialisieren

source: IVec: Unable to update the digest
de: IVec: Kann Digest nicht anpassen

source: IVec: Unable to finalize the digest
de: IVec: Kann Digest nicht abschliessen

source: IVec: Digest does not have expected length
de: IVec: Digest hat unerwartete Länge

source: Error creating password entry
de: Fehler beim Erstellen des Passworteintrages

source: Q U E S T I O N
de: F R A G E

source: Entries modified. Really cancel?
de: Einträge geändert. Wirklich abbrechen?

source: E R R O R
de: F E H L E R

source: Error deleting password entry window
de: Fehler beim Löschen des Passworteingabefensters

source: Error adding box
de: Fehler beim Hinzufügen des Rahmens

source: P A S S W O R D R E C O R D (Read-Only)
de: P A S S W O R T E I N T R A G (Nur Lesen)

source: P A S S W O R D R E C O R D
de: P A S S W O R T E I N T R A G

source: Error setting label
de: Fehler beim Setzen des Labels

source: Error adding label
de: Fehler beim hinzufügen des Labels

source: Username
de: Benutzername

source: Password
de: Passwort

source: Comment
de: Kommentar

source: Save File
de: Datei speichern

source: Load File
de: Datei laden

source: Lock Screen
de: Bildschirm sperren

source: Add Entry
de: Eintrag hinzufügen

source: Delete Entry
de: Eintrag löschen

source: Sort Order
de: Sortierreihenfolge

source: Search
de: Suchen

source: Search Next
de: Weiter suchen

source: Change Password
de: Passwort ändern

source: Redraw Screen
de: Bildschirm neu zeichnen

source: Quit
de: Beenden

source: Password Generator
de: Passwortgenerator

source: Error clearing line
de: Fehler beim Löschen der Zeile

source: K E Y S
de: T A S T E N

source: mvwaddstr() blew it
de: mvwaddstr() vermasselte es

source: wmove() blew it
de: wmove() vermasselte es

source: whline() blew it
de: whline() vermasselte es

source: mvprintw() blew it
de: mvprintw() vermasselte es

source: waddstr() blew it
de: waddstr() vermasselte es

source: File permission check: enabled
de: Dateisicherheit: ein

source: File permission check: disabled
de: Dateisicherheit: aus

source: Screen lock time-out: %u sec
de: Zeit bis Fenstersperrung: %u sek

source: %d entries %s (V: %d)
de: %d Einträge %s (V: %d)

source: PW set: %s
de: PW seit: %s

source: newwin() returned NULL
de: newwin() gab NULL zurück

source: box() blew it
de: box() vermasselte es

source: werase() blew it
de: werase() vermasselte es

source: delwin() blew it
de: delwin() vermasselte es

source: Error refreshing stdscr
de: Fehler beim Auffrischen von stdscr

source: Error refreshing top right window
de: Fehler beim Auffrischen des oberen rechten Fensters

source: Error refreshing bottom right window
de: Fehler beim Auffrischen des unteren rechten Fensters

source: Error while asking for password
de: Fehler beim Abfragen des Passwortes

source: Creation of file canceled
de: Erstellen der Datei abgebrochen

source: created
de: erstellt

source: Error showing error message
de: Fehler beim Anzeigen der Fehlermeldung

source: The file does not exist. Do you want to create it?
de: Datei existiert nicht. Wollen Sie sie erstellen?

source: File creation canceled
de: Dateierstellung abgebrochen

source: The specified file is not a regular file
de: Die angegebene Datei ist keine reguläre Datei

source: UI error while asking for password
de: UI Fehler währen Passwortabfrage

source: opened
de: geöffnet

source: Error while trying to show error
de: Fehler beim Fehleranzeigen

source: Error opening file
de: Fehler beim Öffnen der Datei

source: Opening of
de: Öffnen von

source: canceled
de: abgebrochen

source: saved
de: gespeichert

source: New record added
de: Neuer Eintrag hinzugefügt

source: Record addition canceled
de: Hinzufügen von Eintrag abgebrochen

source: Error adding password entry
de: Fehler beim hinzufügen des Passworteintrages

source: Record edited
de: Eintrag bearbeitet

source: Record edition canceled
de: Bearbeiten des Eintrags abgebrochen

source: Delete selected record?
de: Ausgewählter Eintrag löschen?

source: Record deleted
de: Eintrag gelöscht

source: Error showing dialog
de: Fehler beim Anzeigen des Dialogs

source: Set sort order descending
de: Sortierreihenfolge absteigend

source: Set sort order ascending
de: Sortierreihenfolge aufsteigend

source: Search term not found
de: Begriff nicht gefunden

source: Search canceled
de: Suche abgebrochen

source: Save before quitting?
de: Vor Beenden speichern?

source: Save before changing password?
de: Speichern bevor Passwort geändert wird?

source: Password change aborted
de: Passwortwechsel abgebrochen

source: Password change canceled
de: Passwortwechsel abgebrochen

source: Error reading from file
de: Fehler beim Lesen der Datei

source: Password successfully changed
de: Passwort erfolgreich geändert

source: No file loaded
de: Keine Datei geladen

source: loaded
de: geladen

source: Save before loading other file?
de: Speichern bevor andere Datei geladen wird?

source: O P E N F I L E
de: D A T E I Ö F F N E N

source: rand() (not good)
de: rand() (ungenügend)

source: Error creating password generator window
de: Fehler beim Erstellen des Passwortgeneratorfensters

source: Character Pools
de: Zeichenvorrat

source: Regenerate
de: Regenerieren

source: P A S S W O R D G E N E R A T O R
de: P A S S W O R T G E N E R A T O R

source: Generated Password (using %s):
de: Generiertes Passwort (mit %s):

source: Error printing label
de: Fehler beim Label zeigen

source: Password Length
de: Passwortlänge

source: You need to select at least one Character Pool
de: Mindestens ein Zeichenvorrat muss ausgewählt sein

source: Password must have at least one character
de: Passwort muss mindestens ein Zeichen haben

source: Error drawing box
de: Fehler beim Zeichnen des Rahmens

source: Error creating file open window
de: Fehler beim Erstellen des Datei Öffnen Fensters

source: Error printing cwd
de: Fehler beim Anzeigen des aktuellen Arbeitsverzeichnis

source: Error refreshing cwd
de: Fehler beim Auffrischen des aktuellen Arbeitsverzeichnis

source: Error allocating memory
de: Fehler beim Speicher allozieren

source: Failed to suppress the creation of core file.
de: Kann Erstellung der Core Datei nicht unterdrücken.

source: The error message is:
de: Die Fehlermeldung ist:

source: In case a core file is created, it may contain clear text passwords.
de: Falls eine Core Datei erstellt wird, kann sie Klartextpasswörter enthalten.

source: Press <ENTER> to continue
de: Drücke <EINGABE> um weiterzumachen

source: Cannot suppress the creation of core file.
de: Kann Erstellung der Core Datei nicht unterdrücken.

source: Architecture:
de: Architektur:

source: Compiled with support for terminal title
de: Kompiliert mit Unterstützung für Konsolen Title

source: Compiled without support for terminal title
de: Kompiliert ohne Unterstützung für Konsolen Title

source: Compiled with password generator
de: Kompiliert mit Passwort Generator

source: Compiled without password generator
de: Kompiliert ohne Passwort Generator

source: Support for file security NOT available
de: Unterstützung für Dateisicherheit _nicht_ verfügbar

source: Creation of core file is suppressed
de: Erstellen der Core-Datei unterdrückt

source: Creation of core files is NOT suppressed
de: Erstellen der Core-Datei _nicht_ unterdrückt.

source: show copyright information
de: zeige Urheberechtsinformationen

source: show this help text
de: zeige diesen Hilfetext

source: do not read the configuration file.
de: liest die Konfigurationsdatei nicht.

source: read the configuration file specified by <rcfile>. If this option is not provided, it defaults to $HOME/.yapet unless -i is specified.
de: lese die Konfigurationsdatei angegeben durch <rcfile>. Falls diese Option nicht angegeben ist, wird $HOME/.yapet per Default gelesen, ausser es wurde die -i Option angegeben.

source: disable check of owner and file permissions. When creating new files, the file mode is set to 0644.
de: Prüfung von Eigentümer- und Dateiberechtigung ausschalten. Beim Erstellen von neuen Dateien wird die Dateiberechtigung auf 0644 gesetzt.

source: enable check of owner and file permissions. When creating new files, the file mode is set to 0600.
de: Prüfung von Eigentümer- und Dateiberechtigung einschalten. Beim Erstellen von neuen Dateien wird die Dateiberechtigung auf 0600 gesetzt.

source: the time-out in seconds until the screen is locked. Default: 600 sec.
de: die Zeit in Sekunden bis der Bildschirm gesperrt wird. Default: 600 sek.

source: show the version of
de: zeige die Version von

source: open the specified file <filename>
de: öffne die angegebene Datei <filename>

source: %s stores passwords encrypted on disk using the blowfish encryption algorithm. Point your browser to http://www.guengel.ch/myapps/yapet/ for more information about %s.
de: %s speichert Passwörter verschlüsselt auf Disk unter Verwendung des Blowfish Verschlüsselungsalgorithmus. Gehe auf mit dem Browser auf http://www.guengel.ch/myapps/yapet/ um mehr über %s zu erfahren.

source: without argument
de: ohne Argument

source: unknown argument
de: unbekanntes argument

source: Error creating password dialog
de: Fehler beim Erstellen des Passwortdialogs

source: Passwords do not match
de: Passwörter stimmen nicht überein

source: Error deleting password dialog window
de: Fehler beim Löschen des Passwortdialogs

source: Error clearing password dialog
de: Fehler beim Löschen des Passwortdialogs

source: P A S S W O R D
de: P A S S W O R T

source: Error setting title
de: Fehler beim Setzen des Titels

source: Enter new password for
de: Neues Passwort eingeben für

source: Confirm password
de: Passwort bestätigen

source: Enter password for
de: Passwort eingeben für

source: Error refreshing password dialog
de: Fehler beim Auffrischen des Passwortdialogs

source: May you consider deleting the window before allocating
de: Bitte Fenster löschen bevor allozieren

source: statusbar could not be initialized
de: Statusleiste konnte nicht initialisiert werden

source: Error setting attribute
de: Fehler beim Setzen des Attributs

source: Error setting the statusbar background
de: Fehler beim Setzen des Statusleistenhintergrundes

source: Error erasing status bar
de: Fehler beim Löschen der Statusleiste

source: Error adding status message
de: Fehler beim Hinzufügen der Statusmeldung

source: Error refreshing status bar
de: Fehler beim Auffrischen der Statusleiste

source: status bar could not be deleted
de: Statusleiste konnte nicht gelöscht werden

source: Error creating search dialog
de: Fehler beim Erstellen des Suchdialogs

source: Error deleting search dialog window
de: Fehler beim Löschen des Suchdialogs

source: Error clearing search dialog
de: Fehler beim Säubern des Suchdialogs

source: S E A R C H
de: S U C H E N

source: Please enter the search term
de: Bitten geben Sie den Suchbegriff ein

source: Please enter the search term (case-sensitive)
de: Bitte geben Sie den Suchbegriff ein (Gr.- und Kl.schreibung beachten)

source: Error refreshing the search dialog
de: Fehler beim Auffrischen des Suchdialogs

source: Cannot get character from unused pool because no unused pools are available
de: Kann kein Zeichen von unbenutzten Zeichenbereichen erhalten, da keine vorhanden

source: NULL pointer passed.
de: NULL Zeiger übergeben.

source: No Random Number Generator available
de: Kein Zufallszahlengenerator verfügbar

source: The requested RNG is not available
de: Angeforderter RNG nicht verfügbar

source: Unable to initialize RNG when none is available
de: Kann RNG nicht initialisieren, da keiner vorhanden

source: Unable to open /dev/random
de: Kann /dev/random nicht öffnen

source: Unable to open /dev/urandom
de: Kann /dev/urandom nicht öffnen

source: Unexpected RNG Engine (AUTO)
de: Unerwarte RNG Engine (AUTO)

source: The requested RNG Engine (NONE) is invalid.
de: Die angeforderte RNG Engine (NONE) is ungültig.

source: Read to few bytes on /dev/[u]random.
de: Zu wenig bytes von /dev/[u]random bekommen.

source: lrand48() not available on system
de: lrand48() nicht verfügbar auf diesem System

source: rand() not available on system
de: rand() nicht verfügbar auf diesem System

source: Subpools may not be zero
de: Unterbereiche dürfen nicht Null sein

source: Out of memory
de: Kein Speicher mehr

source: No character at given position
de: Kein Zeichen an gegebener Position

source: Error creating lock window
de: Fehler beim Erstellen des Sperrfensters

source: Error erasing lock window
de: Fehler beim löschen des Sperrfensters

source: Error refreshing lock window
de: Kann Sperrfenster nicht auffrischen

source: YAPET -- Locked --
de: YAPET -- Gesperrt --

source: Wrong password
de: Falsches Passwort
